/**
 *  filename: schema.strings
 *  created : Wed Mar 17 12:43:17 2004
 */

"kMDItemKeywords"                             = "Avainsanat";
"kMDItemTitle"                                = "Otsikko";
"kMDItemSubject"                              = "Aihe";
"kMDItemTheme"                                = "Teema";
"kMDItemAuthors"                              = "Tekijät";
"kMDItemEditors"                              = "Muokkaajat";
"kMDItemProjects"                             = "Projektit";
"kMDItemWhereFroms"                           = "Mistä";
"kMDItemComment"                              = "Kommentti";
"kMDItemCopyright"                            = "Tekijänoikeus";
"kMDItemProducer"                             = "Tuottaja";
"kMDItemUsedDates"                            = "Käytetty päivänä";
"kMDItemLastUsedDate"                         = "Avattu";
"kMDItemContentCreationDate"                  = "Sisältö luotiin";
"kMDItemContentModificationDate"              = "Sisältöä muokattiin";
"kMDItemDurationSeconds"                      = "Kesto";
"kMDItemCreationDate"                         = "Kohde luotiin";
"kMDItemContactKeywords"                      = "Yhteystiedon avainsanat";
"kMDItemVersion"                              = "Versio";
"kMDItemPixelHeight"                          = "Pikselikorkeus";
"kMDItemPixelWidth"                           = "Pikselileveys";
"kMDItemPageHeight"                           = "Sivun korkeus";
"kMDItemPageWidth"                            = "Sivun leveys";
"kMDItemColorSpace"                           = "Väriavaruus";
"kMDItemBitsPerSample"                        = "Bittiä näytettä kohden";
"kMDItemFlashOnOff"                           = "Salama";
"kMDItemFocalLength"                          = "Polttoväli";
"kMDItemHasAlphaChannel"                      = "Alfa-kanava";
"kMDItemAcquisitionMake"                      = "Laitteen merkki";
"kMDItemAcquisitionModel"                     = "Laitteen malli";
"kMDItemISOSpeed"                             = "ISO-nopeus";
"kMDItemOrientation"                          = "Suuntaus";
"kMDItemLayerNames"                           = "Tasot";
"kMDItemWhiteBalance"                         = "Valkotasapaino";
"kMDItemAperture"                             = "Aukko";
"kMDItemProfileName"                          = "Profiilin nimi";
"kMDItemResolutionWidthDPI"                   = "Vaakatarkkuus";
"kMDItemResolutionHeightDPI"                  = "Pystytarkkuus";
"kMDItemExposureMode"                         = "Valotustila";
"kMDItemExposureTimeSeconds"                  = "Valotusaika";
"kMDItemEXIFVersion"                          = "EXIF-versio";
"kMDItemEXIFGPSVersion"                       = "EXIF GPS -versio";
"kMDItemCodecs"                               = "Koodekit";
"kMDItemMediaTypes"                           = "Mediatyypit";
"kMDItemStreamable"                           = "Lähetettävissä";
"kMDItemTotalBitRate"                         = "Kokonaisbittinopeus";
"kMDItemVideoBitRate"                         = "Videon bittinopeus";
"kMDItemAudioBitRate"                         = "Äänen bittinopeus";
"kMDItemDeliveryType"                         = "Toimitustapa";

"kMDItemAltitude"                             = "Korkeus";
"kMDItemLatitude"                             = "Leveysaste";
"kMDItemLongitude"                            = "Pituusaste";

"kMDItemTextContent"                          = "Tekstisisältö";
"kMDItemDisplayName"                          = "Näytön nimi";
"kMDItemAlternateNames"                       = "Vaihtoehtoiset näyttönimet";

"kMDItemRedEyeOnOff"                          = "Punasilmäisyys";
"kMDItemMeteringMode"                         = "Mittaustila";
"kMDItemMaxAperture"                          = "Enimmäisaukko";
"kMDItemFNumber"                              = "Aukkoluku";
"kMDItemExposureProgram"                      = "Valotusohjelma";
"kMDItemExposureTimeString"                   = "Valotusaika";
"kMDItemHeadline"                             = "Yhteenveto";
"kMDItemInstructions"                         = "Ohjeet";
"kMDItemCity"                                 = "Kaupunki";
"kMDItemStateOrProvince"                      = "Osavaltio tai maakunta";
"kMDItemCountry"                              = "Maa";

"kMDItemAlbum"                                = "Albumi";
"kMDItemAudioSampleRate"                      = "Näytetaajuus";
"kMDItemAudioChannelCount"                    = "Kanavien määrä";
"kMDItemTempo"                                = "Tempo";
"kMDItemKeySignature"                         = "Nuottiavain";
"kMDItemTimeSignature"                        = "Tahtilaji";
"kMDItemAudioEncodingApplication"             = "Äänikoodausohjelma";
"kMDItemComposer"                             = "Säveltäjä";
"kMDItemLyricist"                             = "Sanoittaja";
"kMDItemAudioTrackNumber"                     = "Kappaleen numero";
"kMDItemRecordingDate"                        = "Äänityspäivä";
"kMDItemMusicalGenre"                         = "Lajityyppi";
"kMDItemIsGeneralMIDISequence"                = "General MIDI -sekvenssi";
"kMDItemRecipients"                           = "Vastaanottajat";
"kMDItemRecordingYear"                        = "Äänitysvuosi";

"kMDItemOrganizations"                        = "Organisaatiot";
"kMDItemLanguages"                            = "Kielet";
"kMDItemRights"                               = "Oikeudet";
"kMDItemPublishers"                           = "Julkaisijat";
"kMDItemContributors"                         = "Avustajat";
"kMDItemCoverage"                             = "Laajuus";
"kMDItemDescription"                          = "Kuvaus";
"kMDItemIdentifier"                           = "Tunniste";
"kMDItemAudiences"                            = "Kohdeyleisöt";

"kMDItemNumberOfPages"                        = "Sivut";
"kMDItemSecurityMethod"                       = "Salausmenetelmä";

"kMDItemCreator"                              = "Sisällön luoja";
"kMDItemDueDate"                              = "Oltava valmiina";
"kMDItemEncodingApplications"                 = "Koodausohjelma";

"kMDItemStarRating"                           = "Arviointi";
"kMDItemPhoneNumbers"                         = "Puhelinnumero";
"kMDItemEmailAddresses"                       = "Sähköpostiosoitteet";
"kMDItemInstantMessageAddresses"              = "Pikaviestiosoitteet";
"kMDItemKind"                                 = "Laji";
"kMDItemURL"                                  = "Osoite";

"kMDItemRecipientEmailAddresses"              = "Vastaanottajan sähköpostiosoite";
"kMDItemAuthorEmailAddresses"                 = "Tekijöiden sähköpostiosoitteet";

/* Names for FS attributes */
"kMDItemFSName"                               = "Tiedostonimi";
"kMDItemPath"                                 = "Tiedoston polkunimi";
"kMDItemFSSize"                               = "Koko";
"kMDItemFSCreationDate"                       = "Luotu";
"kMDItemFSContentChangeDate"                  = "Muokattu";
"kMDItemFSOwnerUserID"                        = "Omistaja";
"kMDItemFSOwnerGroupID"                       = "Ryhmä";
//"kMDItemFSExists"                             = "File exists";
"kMDItemFSIsReadable"                         = "Tiedosto luettavissa";
"kMDItemFSIsWriteable"                        = "Tiedosto kirjoitettavissa";
"kMDItemFSNodeCount"                          = "Kohteiden määrä";
"kMDItemFSHasCustomIcon"                      = "Muokattu symboli";
"kMDItemFSIsExtensionHidden"                  = "Tiedostopääte piilotettu";
"kMDItemFSIsStationery"                       = "Työpohja";
"kMDItemFSInvisible"                          = "Tiedosto piilotettu";
"kMDItemFSLabel"                              = "Värimerkki";

"kMDItemFinderComment"                        = "Spotlight-kommentti";
"kMDItemFonts"                                = "Kirjasimet";

"kMDItemAppleLoopsRootKey"                    = "Silmukan alkuperäinen sävellaji";
"kMDItemAppleLoopsKeyFilterType"              = "Silmukan asteikon tyyppi";
"kMDItemAppleLoopsLoopMode"                   = "Silmukkatiedoston tyyppi";
"kMDItemAppleLoopDescriptors"                 = "Silmukan kuvaajat";
"kMDItemMusicalInstrumentCategory"            = "Instrumenttikategoria";
"kMDItemMusicalInstrumentName"                = "Instrumentin nimi";

"kMDItemInformation"                          = "Elokuvan tiedot";
"kMDItemDirector"                             = "Ohjaaja";
"kMDItemGenre"                                = "Lajityyppi";
"kMDItemPerformers"                           = "Esiintyjät";
"kMDItemOriginalFormat"                       = "Alkuperäinen muoto";
"kMDItemOriginalSource"                       = "Alkuperäinen lähde";

/* Attribute Descriptions That will be presented to the user
 *
 * In the form of
 * Attribute.Description
 * "." is not a valid character in an Attribute name.
 */
"kMDItemKeywords.Description"                 = "Kohteeseen liittyvät avainsanat";
"kMDItemTitle.Description"                    = "Kohteen otsikko";
"kMDItemSubject.Description"                  = "Kohteen aihe";
"kMDItemTheme.Description"                    = "Teeman otsikko";
"kMDItemAuthors.Description"                  = "Kohteen tekijät";
"kMDItemEditors.Description"                  = "Kohteen muokkaajat";
"kMDItemProjects.Description"                 = "Projektit, joiden osa kohde on";
"kMDItemWhereFroms.Description"               = "Mistä kohde on lähtöisin";
"kMDItemComment.Description"                  = "Kohteen kommentit";
"kMDItemCopyright.Description"                = "Kohteen tekijänoikeustiedot";
"kMDItemProducer.Description"                 = "Kohteen tuottaja";
"kMDItemUsedDates.Description"                = "Kohteen käytön päivämäärät";
"kMDItemLastUsedDate.Description"             = "Kohteen viimeisimmän käytön päiväys";
"kMDItemContentCreationDate.Description"      = "Kohteen sisällön luomispäiväys";
"kMDItemContentModificationDate.Description"  = "Kohteen sisällön muokkauspäiväys";
"kMDItemDurationSeconds.Description"          = "Kohteen kesto sekunneissa";
"kMDItemCreationDate.Description"             = "Kohteen luontipäiväys";
"kMDItemContactKeywords.Description"          = "Kohteeseen liittyvät yhteystiedot";
"kMDItemVersion.Description"                  = "Kohteen versionumero";

"kMDItemPixelHeight.Description"              = "Dokumentin korkeus pikseleissä";
"kMDItemPixelWidth.Description"               = "Dokumentin leveys pikseleissä";
"kMDItemPageHeight.Description"               = "Dokumentin sivun korkeus pisteissä";
"kMDItemPageWidth.Description"                = "Dokumentin sivun leveys pisteissä";
"kMDItemResolutionWidthDPI.Description"       = "Kuvan vaakatarkkuus pisteinä tuumalle";
"kMDItemResolutionHeightDPI.Description"      = "Kuvan pystytarkkuus pisteinä tuumalle";

"kMDItemColorSpace.Description"               = "Kuvan väriavaruusmalli";
"kMDItemProfileName.Description"              = "Kuvassa käytetyn väriprofiilin nimi";

"kMDItemBitsPerSample.Description"            = "Bittien lukumäärä näytettä kohden";
"kMDItemFlashOnOff.Description"               = "Otettiinko kuva salamaa käyttäen";
"kMDItemFocalLength.Description"              = "Linssin polttoväli millimetreissä (mm)";
"kMDItemHasAlphaChannel.Description"          = "Onko kuvassa alfa-kanava";
"kMDItemAcquisitionMake.Description"          = "Dokumentin hankkimiseen käytetyn laitteen merkki";
"kMDItemAcquisitionModel.Description"         = "Dokumentin hankkimiseen käytetyn laitteen malli";
"kMDItemISOSpeed.Description"                 = "Kameran ISO-nopeus kuvaa otettaessa";
"kMDItemOrientation.Description"              = "Kuvan suuntaus (vaaka tai pysty)";
"kMDItemLayerNames.Description"               = "Tiedoston tasojen nimet";
"kMDItemWhiteBalance.Description"             = "Kameran valkotasapainoasetus kuvaa otettaessa";
"kMDItemAperture.Description"                 = "Kameran aukon asetus, kun kuva otettiin";
"kMDItemExposureMode.Description"             = "Valotuksessa käytetty tila";
"kMDItemExposureTimeSeconds.Description"      = "Linssin aukioloaika valotuksessa";
"kMDItemEXIFVersion.Description"              = "Metadatan luomiseen käytetty EXIF-versio";
"kMDItemEXIFGPSVersion.Description"           = "Metadatan luomiseen käytetyn GPSInfoIFD:n versio EXIF:issä";
"kMDItemRedEyeOnOff.Description"              = "Oliko punasilmäisyyden korjaus päällä";
"kMDItemMeteringMode.Description"             = "Mittaustila (tuntematon, keskiarvo, keskustapainotteinen keskiarvo, piste, monipiste, malli, osittainen)";
"kMDItemMaxAperture.Description"              = "Linssin pienin aukkoluku APEX-arvoyksiköissä, yleensä väliltä 00,00 - 99,99";
"kMDItemFNumber.Description"                  = "Aukon halkaisijan suhde linssin teholliseen polttoväliin";
"kMDItemExposureProgram.Description"          = "Kameran valotuksen asettamiseen käyttämän ohjelman tyyppi: manuaalinen, normaali, aukkoautomatiikka...";
"kMDItemExposureTimeString.Description"       = "Valotusaika";
"kMDItemHeadline.Description"                 = "Kohteen sisällön julkaistavissa oleva yhteenveto";
"kMDItemInstructions.Description"             = "Muita kohdetta koskevia tietoja, kuten käsittelyohjeet";
"kMDItemCity.Description"                     = "Kohteen kaupunki";
"kMDItemStateOrProvince.Description"          = "Kohteen osavaltio tai maakunta toimittajan mukaan";
"kMDItemCountry.Description"                  = "Kohteen luontimaa tai -paikka toimittajan mukaan";

"kMDItemAltitude.Description"                 = "Kohteen korkeus merenpinnasta ilmaistuna WGS84-merkinnällä. Negatiiviset arvot ovat merenpinnan alapuolella.";
"kMDItemLatitude.Description"                 = "Kohteen leveysaste asteina päiväntasaajan pohjoispuolella ilmaistuna WGS84-merkinnällä. Negatiiviset arvot ovat päiväntasaajan eteläpuolella.";
"kMDItemLongitude.Description"                = "Kohteen pituusaste asteina meridiaanin itäpuolella ilmaistuna WGS84-merkinnällä. Negatiiviset arvot ovat meridiaanin länsipuolella.";

"kMDItemCodecs.Description"                   = "Median koodaamiseen ja purkamiseen käytetyt koodekit";
"kMDItemMediaTypes.Description"               = "Sisällössä olevat mediatyypit";
"kMDItemStreamable.Description"               = "Onko sisältö valmisteltu lähetystä varten";
"kMDItemTotalBitRate.Description"             = "Median äänen ja videon yhteenlaskettu bittinopeus";
"kMDItemVideoBitRate.Description"             = "Median videon bittinopeus";
"kMDItemAudioBitRate.Description"             = "Median äänen bittinopeus";
"kMDItemDeliveryType.Description"             = "Median toimittamiseen käytetty menetelmä (Fast Start tai RTSP)";
"kMDItemDisplayName.Description"              = "Tiedoston lokalisoitu nimi";
"kMDItemAlternateNames.Description"           = "Tiedoston vaihtoehtoiset nimet";
"kMDItemAlbum.Description"                    = "Mediakokoelman, kuten albumin, otsikko";
"kMDItemAudioSampleRate.Description"          = "Tiedoston äänidatan näytetaajuus";
"kMDItemAudioChannelCount.Description"        = "Tiedoston äänidatan kanavien määrä";
"kMDItemTempo.Description"                    = "Äänitiedoston musiikin tempo iskuina minuutissa";
"kMDItemKeySignature.Description"             = "Äänitiedoston kappaleen sävellaji";
"kMDItemTimeSignature.Description"            = "Ääni- tai MIDI-tiedoston kappaleen tahtilajimerkintä";
"kMDItemAudioEncodingApplication.Description" = "Äänitiedoston datan koodannut ohjelma";
"kMDItemComposer.Description"                 = "Äänitiedoston kappaleen säveltäjä";
"kMDItemLyricist.Description"                 = "Äänitiedoston kappaleen sanoittaja";
"kMDItemAudioTrackNumber.Description"         = "Albumin osana olevan kappaleen numero";
"kMDItemRecordingDate.Description"            = "Kappaleen äänityspäiväys";
"kMDItemMusicalGenre.Description"             = "Äänitiedoston kappaleen lajityyppi";
"kMDItemIsGeneralMIDISequence.Description"    = "Voidaanko tiedostossa olevaa MIDI-sekvenssiä käyttää General MIDI -laitteen kanssa";
"kMDItemRecordingYear.Description"            = "Kohteen äänitysvuosi";

"kMDItemOrganizations.Description"            = "Dokumentin luoneet organisaatiot";
"kMDItemLanguages.Description"                = "Dokumentin sisällön kielet";
"kMDItemRights.Description"                   = "Linkki tietoihin dokumentin tekijänoikeuksista";
"kMDItemPublishers.Description"               = "Dokumentin julkaisija";
"kMDItemContributors.Description"             = "Dokumentin sisältöön vaikuttaneet ihmiset tai organisaatiot";
"kMDItemCoverage.Description"                 = "Dokumentin sisällön laajuus tai kattavuus";
"kMDItemDescription.Description"              = "Dokumentin sisällön kuvaus";
"kMDItemIdentifier.Description"               = "Viittaus resurssiin annetussa kontekstissa";
"kMDItemAudiences.Description"                = "Kenelle dokumentti on tarkoitettu";

"kMDItemNumberOfPages.Description"            = "Dokumentin sivujen määrä";
"kMDItemSecurityMethod.Description"           = "Dokumentin suojaamiseen käytetty salausmenetelmä";
"kMDItemCreator.Description"                  = "Dokumentin luomiseen käytetty ohjelma";
"kMDItemEncodingApplications.Description"     = "Alkuperäisen sisällön muuntamiseen käytetty ohjelma";
"kMDItemDueDate.Description"                  = "Päivämäärä, johon mennessä kohteen on oltava valmis";

"kMDItemStarRating.Description"               = "Käyttäjän arviointi";
"kMDItemPhoneNumbers.Description"             = "Kohteeseen liittyvät puhelinnumerot";
"kMDItemEmailAddresses.Description"           = "Kohteeseen liittyvät sähköpostiosoitteet";
"kMDItemInstantMessageAddresses.Description"  = "Kohteeseen liittyvät pikaviestiosoitteet";
"kMDItemKind.Description"                     = "Kohteen laji";
"kMDItemFinderComment.Description"            = "Kohteen Spotlight-kommentti";
"kMDItemTextContent.Description"              = "Kohteen tekstisisältö";
"kMDItemRecipients.Description"               = "Kohteen vastaanottajat";
"kMDItemFonts.Description"                    = "Kohteessa käytetyt kirjasimet";
"kMDItemURL.Description"                      = "Kohteen osoite";
"kMDItemRecipientEmailAddresses.Description"  = "Kohteen vastaanottajien sähköpostiosoitteet";
"kMDItemAuthorEmailAddresses.Description"     = "Kohteen tekijöiden sähköpostiosoitteet";

"kMDItemInformation.Description"              = "Elokuvan tiedot";
"kMDItemDirector.Description"                 = "Ohjaaja";
"kMDItemGenre.Description"                    = "Lajityyppi";
"kMDItemPerformers.Description"               = "Esiintyjät";
"kMDItemOriginalFormat.Description"           = "Alkuperäinen muoto";
"kMDItemOriginalSource.Description"           = "Alkuperäinen lähde";

"kMDItemFSName.Description"                   = "Tiedoston nimi";
"kMDItemPath.Description"                     = "Tiedoston täydellinen polku";
"kMDItemFSSize.Description"                   = "Levyllä olevan tiedoston koko tavuissa, pyöristettynä levyn lohkokoon mukaan";
"kMDItemFSCreationDate.Description"           = "Tiedoston luontipäiväys";
"kMDItemFSContentChangeDate.Description"      = "Tiedoston sisällön viimeisin muutospäiväys";
"kMDItemFSOwnerUserID.Description"            = "Tiedoston omistajan käyttäjätunnus";
"kMDItemFSOwnerGroupID.Description"           = "Tiedoston omistajan ryhmätunnus";
"kMDItemFSIsReadable.Description"             = "Voidaanko tiedosto avata, mutta ei muuttaa";
"kMDItemFSIsWriteable.Description"            = "Voidaanko tiedostoa muuttaa";
"kMDItemFSNodeCount.Description"              = "Kansiossa olevien tiedostojen ja kansioiden määrä";
"kMDItemFSHasCustomIcon.Description"          = "Onko tiedostolla muokattu symboli";
"kMDItemFSIsExtensionHidden.Description"      = "Onko tiedostopääte piilotettu";
"kMDItemFSIsStationery.Description"           = "Onko tiedosto työpohja";
"kMDItemFSInvisible.Description"              = "Onko tiedosto piilotettu";
"kMDItemFSLabel.Description"                  = "Tiedostoon liitettyä Finder-merkkiä vastaava numero";

"kMDItemAppleLoopsRootKey.Description"        = "Näyttää silmukan alkuperäisen sävellajin. Sävellaji on silmukan pohjasävel tai perussävel eikä se sisällä asteikon tyyppiä";
"kMDItemAppleLoopsKeyFilterType.Description"  = "Käyttääkö silmukka duuri- vai molliasteikkoa, ei kumpaakaan vai voidaanko sitä käyttää molempien kanssa";
"kMDItemAppleLoopsLoopMode.Description"       = "Onko tiedosto silmukoiva vai ei-silmukoiva. Silmukoivat tiedostot säätävät temponsa kappaleen tempoon; ei-silmukoivat tiedostot säilyttävät äänitetyn temponsa";
"kMDItemAppleLoopDescriptors.Description"     = "Silmukan tunnelmaa ja muita ominaisuuksia kuvaavat avainsanat";
"kMDItemMusicalInstrumentCategory.Description"= "Tiedoston instrumenttikategoria";
"kMDItemMusicalInstrumentName.Description"    = "Tiedostoon äänitetyn instrumentin tyyppi";


/* Attribute short names That will be presented to the user
 *
 * In the form of
 * Attribute.ShortName
 * "." is not a valid character in an Attribute name.
 * These strings should all be sort and 1 word with no spaces in them.
 */
"kMDItemKeywords.ShortName"                   = "keyword";
"kMDItemTitle.ShortName"                      = "title";
"kMDItemSubject.ShortName"                    = "subject,title";
"kMDItemTheme.ShortName"                      = "teema";
"kMDItemAuthors.ShortName"                    = "tekijä";
"kMDItemEditors.ShortName"                    = "editori";
"kMDItemProject.ShortName"                    = "project";
"kMDItemWhereFroms.ShortName"                 = "wherefrom";
"kMDItemComment.ShortName"                    = "comment,Kommentti";
"kMDItemCopyright.ShortName"                  = "copyright";
"kMDItemProducer.ShortName"                   = "tuottaja";
"kMDItemUsedDates.ShortName"                  = "used,date";
"kMDItemLastUsedDate.ShortName"               = "lastused,date";
"kMDItemContentCreationDate.ShortName"        = "contentcreated,created,date";
"kMDItemContentModificationDate.ShortName"    = "contentmodified,modified,date";
"kMDItemDurationSeconds.ShortName"            = "duration,time";
"kMDItemCreationDate.ShortName"               = "itemcreated,created,date";
"kMDItemContactKeywords.ShortName"            = "contactkeyword,keyword";
"kMDItemVersion.ShortName"                    = "versio";
"kMDItemPixelHeight.ShortName"                = "pixelheight,height";
"kMDItemPixelWidth.ShortName"                 = "pixelwidth,width";
"kMDItemPageHeight.ShortName"                 = "pageheight,height";
"kMDItemPageWidth.ShortName"                  = "pagewidth,height";
"kMDItemColorSpace.ShortName"                 = "colorspace,Väriavaruus";
"kMDItemBitsPerSample.ShortName"              = "bitspersample,bps";
"kMDItemFlashOnOff.ShortName"                 = "flash";
"kMDItemFocalLength.ShortName"                = "focallength";
"kMDItemHasAlphaChannel.ShortName"            = "alpha";
"kMDItemAcquisitionMake.ShortName"            = "make";
"kMDItemAcquisitionModel.ShortName"           = "model";
"kMDItemISOSpeed.ShortName"                   = "iso";
"kMDItemOrientation.ShortName"                = "orientation";
"kMDItemLayerNames.ShortName"                 = "layer";
"kMDItemWhiteBalance.ShortName"               = "whitebalance";
"kMDItemAperture.ShortName"                   = "aperture,fstop";
"kMDItemProfileName.ShortName"                = "profile";
"kMDItemResolutionWidthDPI.ShortName"         = "widthdpi,dpi";
"kMDItemResolutionHeightDPI.ShortName"        = "heightdpi,dpi";
"kMDItemExposureMode.ShortName"               = "exposuremode";
"kMDItemExposureTimeSeconds.ShortName"        = "exposuretime,time";
"kMDItemEXIFVersion.ShortName"                = "exifversion";
"kMDItemCodecs.ShortName"                     = "codec";
"kMDItemMediaTypes.ShortName"                 = "mediatype";
"kMDItemStreamable.ShortName"                 = "streamable,Lähetettävä";
"kMDItemTotalBitRate.ShortName"               = "totalbitrate,bitrate";
"kMDItemVideoBitRate.ShortName"               = "videobitrate,bitrate";
"kMDItemAudioBitRate.ShortName"               = "audiobitrate,bitrate";
"kMDItemDeliveryType.ShortName"               = "delivery";
"kMDItemAltitude.ShortName"                   = "korkeus";
"kMDItemLatitude.ShortName"                   = "leveysaste";
"kMDItemLongitude.ShortName"                  = "pituusaste";

"kMDItemTextContent.ShortName"                = "intext";
"kMDItemDisplayName.ShortName"                = "displayname,name";

"kMDItemRedEyeOnOff.ShortName"                = "redeye";
"kMDItemMeteringMode.ShortName"               = "meteringmode";
"kMDItemMaxAperture.ShortName"                = "maxaperture";
"kMDItemFNumber.ShortName"                    = "fnumber,fstop";
"kMDItemExposureProgram.ShortName"            = "exposureprogram";
"kMDItemExposureTimeString.ShortName"         = "exposuretime,time";
"kMDItemHeadline.ShortName"                   = "headline,title";
"kMDItemInstructions.ShortName"               = "instructions";
"kMDItemCity.ShortName"                       = "city,Kaupunki";
"kMDItemStateOrProvince.ShortName"            = "state,province";
"kMDItemCountry.ShortName"                    = "country";

"kMDItemAlbum.ShortName"                      = "album,title";
"kMDItemAudioSampleRate.ShortName"            = "audiosamplerate,samplerate";
"kMDItemAudioChannelCount.ShortName"          = "channels";
"kMDItemTempo.ShortName"                      = "tempo";
"kMDItemKeySignature.ShortName"               = "keysignature,key";
"kMDItemTimeSignature.ShortName"              = "timesignature";
"kMDItemAudioEncodingApplication.ShortName"   = "audioencodingapplication";
"kMDItemComposer.ShortName"                   = "composer,author,by";
"kMDItemLyricist.ShortName"                   = "lyricist,author,by";
"kMDItemAudioTrackNumber.ShortName"           = "tracknumber";
"kMDItemRecordingDate.ShortName"              = "recordingdate,date";
"kMDItemMusicalGenre.ShortName"               = "musicalgenre,genre";
"kMDItemIsGeneralMIDISequence.ShortName"      = "ismidi";
"kMDItemRecipients.ShortName"                 = "vastaanottaja";
"kMDItemRecordingYear.ShortName"              = "yearrecorded,year";

"kMDItemOrganizations.ShortName"              = "organization,Organisaatio";
"kMDItemLanguages.ShortName"                  = "language";
"kMDItemRights.ShortName"                     = "rights,Oikeudet";
"kMDItemPublishers.ShortName"                 = "publisher";
"kMDItemContributors.ShortName"               = "avustaja,tekijä";
"kMDItemCoverage.ShortName"                   = "coverage,Laajuus";
"kMDItemDescription.ShortName"                = "description,comment";
"kMDItemIdentifier.ShortName"                 = "id";
"kMDItemAudiences.ShortName"                  = "audience,to";

"kMDItemNumberOfPages.ShortName"              = "pages";
"kMDItemSecurityMethod.ShortName"             = "securitymethod";

"kMDItemCreator.ShortName"                    = "creator";
"kMDItemDueDate.ShortName"                    = "duedate,date";
"kMDItemEncodingApplications.ShortName"       = "encodingapplication";

"kMDItemStarRating.ShortName"                 = "starrating";
"kMDItemPhoneNumbers.ShortName"               = "phonenumber";
"kMDItemEmailAddresses.ShortName"             = "email";
"kMDItemInstantMessageAddresses.ShortName"    = "imname";
"kMDItemKind.ShortName"                       = "kind";
"kMDItemURL.ShortName"                        = "url,osoite";
"kMDItemRecipientEmailAddresses.ShortName"    = "sähköposti, vastaanottaja";
"kMDItemAuthorEmailAddresses.ShortName"       = "sähköposti, lähettäjä";

/* Names for FS attributes */
"kMDItemFSName.ShortName"                     = "filename";
"kMDItemPath.ShortName"                       = "path";
"kMDItemFSSize.ShortName"                     = "size";
"kMDItemFSCreationDate.ShortName"             = "created";
"kMDItemFSContentChangeDate.ShortName"        = "modified";
"kMDItemFSOwnerUserID.ShortName"              = "owner";
"kMDItemFSOwnerGroupID.ShortName"             = "group";
"kMDItemFSIsStationery.ShortName"             = "stationery,Lukittu";
"kMDItemFSInvisible.ShortName"                = "invisible,Näkymätön";
"kMDItemFSLabel.ShortName"                    = "label";

"kMDItemFinderComment.ShortName"              = "spotlightcomment,comment";
"kMDItemFonts.ShortName"                      = "font";

"kMDItemMusicalInstrumentCategory.ShortName"  = "instrumentcategory";
"kMDItemMusicalInstrumentName.ShortName"      = "instrumentname";
